app/controllers/comments_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 1]]
---
  def new
    @post = Post.find(params[:post_id])

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("text", "user_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["text", "Bad man!"], ["user_id", 1], ["post_id", 1], ["created_at", "2015-06-02 17:44:03.079785"], ["updated_at", "2015-06-02 17:44:03.079785"]]
---
  def create
    @post = Post.find(params[:post_id])
    @post.comments.create(options = { text: comments_params[:text], user: current_user })