app/controllers/likes_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "likes" ("user_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 2], ["post_id", 1], ["created_at", "2015-04-06 20:31:46.473179"], ["updated_at", "2015-04-06 20:31:46.473179"]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = $1  [["post_id", 1]]
---
  def create
    @post = Post.find(params[:post_id])
    if current_user
      if current_user.has_liked?(@post)
        like_message = "You liked this"
      else
        @post.likes.create(user: current_user)
        like_message = "You liked this"
      end
    else
      like_message = "Please login!"
    end
    render json: { new_like_count: @post.likes.count, like_message: like_message }