app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Peace out"], ["description", "Peace"], ["user_id", 2], ["created_at", "2015-06-02 10:50:38.021826"], ["updated_at", "2015-06-02 10:50:38.021826"]]
---
  def create
    @post = Post.create(options = { title: post_params[:title],
                                    description: post_params[:description],
                                    image: post_params[:image],
                                    user: current_user })